{
  "users": [
    {
      "id": 1,
      "fullName": "Tiffany Baker",
      "email": "TAGesner@gmail.com"
    },
    {
      "id": 2,
      "fullName": "Holly Adkins",
      "email": "holly@mac.com"
    },
    {
      "id": 3,
      "fullName": "Summer Lovetro",
      "email": "summer@yahoo.com"
    },
    {
      "id": 4,
      "fullName": "Stacey Buckner",
      "email": "stacey@aol.com"
    }
  ],
  "recipes": [
    {
      "userId": 1,
      "typeId": 3,
      "name": "Healthy Lemon Bars",
      "ingredients": "Produce 1 tsp Lemon, zest Refrigerated 3 Eggs + 1 egg yolk Condiments 3/4 cup Lemon juice, fresh squeezed 3/4 cup Maple syrup Baking & Spices 1 1/2 cups Almond flour 5/16 cup Coconut flour 1/4 tsp Salt 1 tsp Vanilla Oils & Vinegars 1/3 cup Coconut oil",
      "directions": "blah blah blah and more blah",
      "id": 2
    },
    {
      "userId": 1,
      "typeId": 2,
      "name": "foo bars",
      "ingredients": "foo foo foo foo foo bar bar bar bar",
      "directions": "foo bar",
      "id": 4
    },
    {
      "userId": 2,
      "name": "Homemade Laurabars",
      "ingredients": "1 cup nuts any combination, 1 ½ cups dates or a combination of dates and another variety of dried fruit, 1 dash of salt",
      "directions": "1. Place dates into a small heat-safe bowl. Pour hot water over the dates and allow to soak for 10-15 minutes to soften the dates. 2. Once the dates have soaked, drain the liquid off the dates, reserving the liquid to use if needed. 3. Fit a food processor with an s-blade. Place nuts in the food processor and pulse until the nuts break down into small pieces.  4. Add in the dates and dash of salt, and pulse the mixture together until the dates have broken down and a thick paste forms, scraping the sides down if needed. Add in 1 to 2 tablespoons of the soaking liquid if needed to help bring the mixture together.  5. To shape larabars press mixture into a 7×11 pan lined with parchment paper and refrigerate for 30 minutes before slicing int0 6 bars. 6. Alternatively, you can shape the mixture into 1-2 inch balls for a bite-size treat.",
      "typeId": "2",
      "id": 6
    },
    {
      "userId": 4,
      "name": "Healthy Granola Bars",
      "ingredients": "4 cups old-fashioned rolled oats (use certified gluten-free oats for gluten-free granola), 1 ½ cup raw nuts and/or seeds (I used 1 cup pecans and ½ cup pepitas), 1 teaspoon fine-grain sea salt (if you’re using standard table salt, scale back to ¾ teaspoon), ½ teaspoon ground cinnamon, ½ cup melted coconut oil or olive oil, ½ cup maple syrup or honey, 1 teaspoon vanilla extract, ⅔ cup dried fruit, chopped if large (I used dried cranberries). Totally optional additional mix-ins: ½ cup chocolate chips or coconut flakes",
      "directions": "Preheat oven 350F. 1. Combine oats, nuts, seeds, salt and cinnamon.  2. Pour in oil, maple syrup and vanilla.  3. Bake 21-24 minutes...until lightly golden  4. Let cool completely. It will store for up to 2 weeks.",
      "typeId": "2",
      "id": 7
    },
    {
      "userId": 4,
      "name": "GF Pizza Quesadilla",
      "ingredients": "2 Corn Tortillas or other gluten-free tortilla of choice, 1/4 cup shredded mozzarella,  4 slices pepperoni see notes for vegan modification sprinkle Italian seasoning, 1/2 cup tomato sauce of choice, gluten-free cooking spray",
      "directions": "1. Heat pan on medium heat.  2. Once heated, spray with cooking spray and lay a tortilla on top of the pan.  3. Sprinkle cheese, seasoning, and pepperonis on top of the tortilla. Place a lid on top of the pan so the cheese melts. It should take 1-2 minutes for the cheese to melt.  4. Once the cheese is melted, remove the lid and place second tortilla on top. Flip quesadilla and toast the other side for 1-2 minutes so both sides can be toasted.  5. Slice the quesadilla into triangles and dip in favorite pizza or pasta sauce",
      "typeId": "4",
      "id": 8
    },
    {
      "userId": 1,
      "name": "GF Quesadilla Pizza Dips",
      "ingredients": "2 Corn Tortillas or other gluten-free tortilla of choice, 1/4 cup shredded mozzarella see notes for dairy-free/vegan modification, 4 slices pepperoni see notes for vegan modification, sprinkle Italian seasoning, 1/2 cup tomato sauce of choice, gluten-free cooking spray",
      "directions": "1. Heat pan on medium heat. 2. Once heated, spray with cooking spray and lay a tortilla on top of the pan. 3. Sprinkle cheese, seasoning, and pepperonis on top of the tortilla. 4. Place a lid on top of the pan so the cheese melts. It should take 1-2 minutes for the cheese to melt. 5. Once the cheese is melted, remove the lid and place second tortilla on top. Flip quesadilla and toast the other side for 1-2 minutes so both sides can be toasted. 6. Slice the quesadilla into triangles and dip in favorite pizza or pasta sauce",
      "typeId": "4",
      "id": 9
    },
    {
      "userId": 1,
      "name": "Garlic Chickpea Soup",
      "ingredients": "Produce: 2 cans (15 oz each) chickpeas 1 (6oz-180 grams) large potato, large 1/4 tsp Chili flakes 3 Garlic cloves, large 1 tsp Rosemary, dried 1/2 tsp Thyme, dried Canned Goods: 2 cups Vegetable broth, low-sodium Baking & Spices: 1 tsp Paprika 1 Salt & black pepper Oils & Vinegars: 1 tbsp Olive oil",
      "directions": "1. Blend half of the chickpeas. 2. Sauté garlic in olive oil. 3. Add chickpeas, herbs, spices, and potato. 4. Stir in broth. 5. Cook for 25 minutes.",
      "typeId": "1",
      "id": 10
    },
    {
      "userId": 1,
      "name": "GF Mozzarella Sticks",
      "ingredients": "Produce 1 tsp Basil, dried 1/2 tsp Garlic powder 1 tsp Oregano, dried 1 tbsp Parsley, dried 1 Parsley Refrigerated 2 Eggs Condiments 1 Marinara sauce Baking & Spices 1/4 cup All-purpose gluten-free flour 1 Salt and pepper Oils & Vinegars 1 Oil Bread & Baked Goods 2 cups Panko breadcrumbs, gluten-free Dairy 1 tbsp Milk 12 Mozzarella string cheese sticks",
      "directions": "1. Line baking sheet with parchment paper. 2, Place flour in one bowl. 3. In second bowl, whisk eggs and milk until combined. 4. In third bowl, thoroughly combine bread crumbs, salt, pepper, parsley, garlic powder, basil, and oregano. 5. Take one mozzarella stick. Dip in flour and roll until lightly coated. Don't forget to coat ends of cheese stick in all steps. 6. Immediately dip flour-coated mozzarella stick into egg wash. Roll until coated. 7. From egg wash, immediately dip mozzarella stick into breadcrumb mixture. Roll until coated. Gently press the panko onto mozzarella stick. 8. Fry approximately 2 minutes, until breading is golden brown and crispy. Transfer cooked mozzarella sticks to paper towel to drain oil. Repeat process for remaining mozzarella sticks.",
      "typeId": "2",
      "id": 11
    }
  ],
  "ratings": [
    {
      "id": 1,
      "name": ""
    }
  ],
  "recipeRatings": [],
  "comments": [
    {
      "id": 1,
      "userId": 2,
      "content": "First message. Hope this works."
    },
    {
      "userId": 1,
      "content": "2nd message. 😍",
      "messageDate": "",
      "id": 2
    },
    {
      "userId": 1,
      "content": "New bakers should try adding extra vanilla and/or spices to recipes. Gluten-free flours often have unique tastes, and adding additional flavoring to recipes will help cover up these unfamiliar flavors.",
      "messageDate": "",
      "id": 3
    },
    {
      "userId": 1,
      "content": "To avoid baked goods becoming soggy, transfer to a wire rack as soon as possible after baking to ensure that they cool properly.",
      "messageDate": "",
      "id": 4
    },
    {
      "userId": 4,
      "content": "Substituting 1/4 cup ground flaxseed in 1/4 cup water for 1/4 cup flour will increase nutrition in any recipe.",
      "messageDate": "",
      "id": 5
    },
    {
      "userId": 1,
      "content": "Coconut, soy, rice and nut milks can be substituted for regular milk. ❤🥛",
      "id": 6
    },
    {
      "userId": 1,
      "content": "Gluten-free baking at high altitude requires less liquid and either a higher oven temperature or a longer baking time. 🏔",
      "id": 7
    },
    {
      "userId": 3,
      "content": "Maple syrup, brown rice syrup and agave can also be used instead of honey. 🍯",
      "id": 8
    }
  ],
  "types": [
    {
      "id": 1,
      "typeName": "Dinner"
    },
    {
      "id": 2,
      "typeName": "Snack"
    },
    {
      "id": 3,
      "typeName": "Dessert"
    },
    {
      "id": 4,
      "typeName": "Lunch"
    }
  ],
  "recipeAllergens": [
    {
      "id": 1,
      "recipeId": 2,
      "allergenId": 3
    }
  ],
  "articles": [
    {
      "id": 1,
      "articleName": "Foods Naturally Gluten-Free",
      "content": "https://docs.google.com/document/d/1U4p9nm4OPgSxlZ-Z3QdOflzL4nTpLzq-/edit?usp=sharing&ouid=102191510647996155577&rtpof=true&sd=true"
    },
    {
      "id": 2,
      "articleName": "15 Ingredients to Question Before Consuming",
      "content": "https://docs.google.com/document/d/1VKwyZ-oVcWdBWhUygvbsRAFAiAlLatjq/edit?usp=sharing&ouid=102191510647996155577&rtpof=true&sd=true"
    },
    {
      "id": 3,
      "articleName": "Wheat Alternatives",
      "content": "https://docs.google.com/document/d/19zmQvJ1WChRv8B5nzHNMrej_ntaIH8V8/edit?usp=sharing&ouid=102191510647996155577&rtpof=true&sd=true"
    },
    {
      "id": 4,
      "articleName": "10 Different Names of Wheat",
      "content": "https://docs.google.com/document/d/1W8LeKjxQjPuwcakmJb43-Px4Oqloob67/edit?usp=sharing&ouid=102191510647996155577&rtpof=true&sd=true"
    }
  ]
}